import datetime
import json
import re


почеток = re.compile(r".*Разговор\s+помеѓу\s+([\w -]+).*\s+и\s+([\w -]+)",
                     flags=re.UNICODE&re.IGNORECASE)


class Пуч:
    def __repr__(пуч):
        return пуч.__unicode__()

    def __iter__(пуч):
        return iter(пуч.__dict__.items())


class Соговорник(Пуч):
    def __init__(личност, име_презиме):
        личност.назив = име_презиме.strip().split()
        личност.иницијали = "".join([a for a in име_презиме if a.isupper()])

    def __unicode__(личност):
        return "{} {}".format(личност.иницијали, " ".join(личност.назив))


class Разговор(Пуч):
    def __init__(разговор, бомба, реден_број, наслов, текст):
        разговор.бомба = бомба
        разговор.реден_број = реден_број

        имиња = почеток.search(наслов).groups()
        assert len(имиња) == 2
        разговор.соговорници = [Соговорник(име_презиме) for име_презиме in имиња]
        разговор.содржина = [линија.strip() for линија in текст if
                             линија.strip() != ""]

    def __unicode__(разговор):
        return "Разговор помеѓу {} и {}".format(*разговор.соговорници)

    def __iter__(разговор):
        d = разговор.__dict__
        d['соговорници'] = [dict(с) for с in разговор.соговорници]
        d['бомба'] = dict(разговор.бомба)
        return iter(d.items())


class Бомба(Пуч):
    def __init__(бомба, датум, реден_број):
        бомба.датум = датум
        бомба.реден_број = реден_број

    def __unicode__(бомба):
        return "{} {}".format(бомба.датум, бомба.реден_број)

    def __iter__(бомба):
        d = бомба.__dict__
        if isinstance(бомба.датум, datetime.datetime):
            d['датум'] = бомба.датум.isoformat()
        return iter(d.items())


def креирај_транскрипт(име_на_датотека, реден_број_на_бомба):
    реден_број_на_разговор = 1

    fdt = re.search('\d{4}.\d{2}.\d{2}', име_на_датотека).group()

    датум = datetime.datetime.strptime(fdt, '%Y.%m.%d')
    бомба = Бомба(датум, реден_број_на_бомба)

    with open(име_на_датотека, 'r') as датотека:
        разговори = []

        линија = next(датотека).strip()
        while not почеток.match(линија):
            линија = next(датотека).strip()

        наслов = линија
        текст = []
        for линија in датотека:
            if почеток.match(линија):
                разговори.append(Разговор(бомба, реден_број_на_разговор,
                                          наслов, текст))
                наслов = линија
                текст = []
                реден_број_на_разговор += 1
            elif линија.strip() != '':
                текст += [линија]

        разговори.append(Разговор(бомба, реден_број_на_разговор,
                                  наслов, текст))
        наслов = линија
        return разговори


def креирај_и_запиши_џејсон(број_на_бомба, фајл):
    разговори = креирај_транскрипт(фајл, број_на_бомба)
    транскрипт = {'разговори': [dict(р) for р in разговори]}

    џејсон_фајл = фајл.replace(".txt", ".json")
    with open(џејсон_фајл, 'w+') as jsonf:
        json.dump(транскрипт, jsonf)


if __name__ == "__main__":
    import glob
    import os
    import sys

    if len(sys.argv) == 1:
        листа_фајлови = sorted(glob.glob('транскрипти/*.txt'))
        for i, датотека in enumerate(листа_фајлови, 1):
            креирај_и_запиши_џејсон(i, датотека)
    else:
        фајл = sys.argv[1]
        број_на_бомба = sys.argv[2]
        креирај_и_запиши_џејсон(број_на_бомба, фајл)
